In [1]:
# importing libraries

import pandas as pd

In [2]:
data = {'Name': ['John', 'Mary', 'Bob', 'Sarah', 'Tom', 'Lisa'], 'Department': ['IT', 'Marketing', 'Sales', 'IT', 'Finance', 'Marketing'], 'Age': [30, 40, 25, 35, 45, 28], 'Gender': ['Male', 'Female', 'Male', 'Female', 'Male', 'Female'], 'Salary': [50000, 60000, 45000, 55000, 70000, 55000], 'Experience': [3, 7, 2, 5, 10, 4]}

In [3]:
employee_df = pd.DataFrame(data)

In [4]:
employee_df

    Name Department  Age  Gender  Salary  Experience
0   John         IT   30    Male   50000           3
1   Mary  Marketing   40  Female   60000           7
2    Bob      Sales   25    Male   45000           2
3  Sarah         IT   35  Female   55000           5
4    Tom    Finance   45    Male   70000          10
5   Lisa  Marketing   28  Female   55000           4

In [ ]:
# select the first three rows using iloc
employee_df.iloc[0:3]

   Name Department  Age  Gender  Salary  Experience
0  John         IT   30    Male   50000           3
1  Mary  Marketing   40  Female   60000           7
2   Bob      Sales   25    Male   45000           2

In [ ]:
# select all rows where department is marketing using loc
employee_df.loc[employee_df["Department"] == "Marketing"]

   Name Department  Age  Gender  Salary  Experience
1  Mary  Marketing   40  Female   60000           7
5  Lisa  Marketing   28  Female   55000           4

In [11]:
# select age and gender for the the first 4 rows using iloc
employee_df.iloc[0:4, 2:4]

   Age  Gender
0   30    Male
1   40  Female
2   25    Male
3   35  Female

In [13]:
# select salary and experience columns for all rows where gender is male using loc
employee_df.loc[employee_df["Gender"] == "Male", ["Salary", "Experience"]]

   Salary  Experience
0   50000           3
2   45000           2
4   70000          10